Revit 2024 API
ExternalDataInstanceAddingIntoDocumentEventArgs.TypeId Property
 The type id of the newl external data instance that is being added.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public ElementId TypeId { get; }
Visual Basic
Public ReadOnly Property TypeId As ElementId
	Get
Visual C++
public:
property ElementId^ TypeId {
	ElementId^ get ();
}
See Also
ExternalDataInstanceAddingIntoDocumentEventArgs Class
Autodesk.Revit.DB.Events Namespace